app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `description`, `is_featured`, `title`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 26 Sep 2012 04:02:47 UTC +00:00], ["description", "some description"], ["is_featured", false], ["title", "test"], ["updated_at", Wed, 26 Sep 2012 04:02:47 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save